Revit 2026 API

# IFCImportOptionsSetExtraOptions Method

---
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetExtraOptions(
	IDictionary<string, string> options
)
```
```vb
Public Sub SetExtraOptions (
	options As IDictionary(Of String, String)
)
```
```cpp
public:
void SetExtraOptions(
	IDictionary<String^, String^>^ options
)
```
```fsharp
member SetExtraOptions :
        options : IDictionary<string, string> -> unit
```

#### Parameters

options IDictionaryString, String

#### Reference

IFCImportOptions Class

Autodesk.Revit.DB.IFC Namespace